/**
 * 类库、插件、UI组件、框架
 * 1.类库：JQ/Zepto...
 *        提供一些真实项目中常用的方法，任何项目都可以把类库导入进来，调取里面的方法实现自己需要的业务逻辑
 * 2.插件：具备一定的业务功能，例如，我们可以封装轮播图插件、选项卡插件、模态框插件等（插件规定了当前这个功能的样式结构，把实现功能呢的
 *      js进行封装，以后想实现这个功能直接导入插件即可） swiper\iscorll\jquery-dialog\jquery-drag\jquery-datapicker\echarts
 * 3.UI组件：把结构、css、js全部都封装好了，我们想实现一个功能直接导入进来即可（偶尔需要我们修改一下）bootstrap...
 * 4.框架：具备一定的编程思想，要求我们按照框架的思想开发，一般框架中提供了常用的类库方法，提供了强大的功能插件，有的也提供了强大的UI组件...
 *         React(React native) / Vue /Angular/Backbone /Sea.js /Require.js ...
 * JQuery:非常优秀的JS类库
 *      基于原生JS封装的一个类库，提供了很多的方法，而且这些方法是兼容所有浏览器的
 *          JQ版本：
 *          v1(常用) 1.8.3   1.9.3  1.11.3      
 */
